# Напишіть функцію, яка приймає 2 списки.
# Результатом має бути новий список, в якому знаходяться елементи першого списку, яких немає в другому.
# Порядок елементів, що залишилися має відповідати порядку в першому (оригінальному) списку.
# Реалізуйте обчислення за допомогою генератора.
#
#     Приклад:
#     array_diff([1, 2], [1]) --> [2]
#     array_diff([1, 2, 2, 2, 4, 3, 4], [2]) --> [1, 4, 3, 4]

def array_diff(lst_1: list, lst_2: list) -> list:
    diff_elements = [elem for elem in lst_1 if elem not in lst_2]
    return diff_elements


print(f'Result: {array_diff([1, 2], [1])}')
print(f'Result: {array_diff([1, 2, 2, 2, 4, 3, 4], [2])}')
